In [14]:
#inner join
import pandas as ps
val1 = {'City':['chennai','bangalore','CBE'],
       'Temp':['32','22','28']}
df1 = ps.DataFrame(val1)
df1

        City Temp
0    chennai   32
1  bangalore   22
2        CBE   28

In [30]:
val2 = {'City':['chennai','bangalore','Trichy'],
       'Degree':['31','24','34']}
df2 = ps.DataFrame(val2)
df2

        City Degree
0    chennai     31
1  bangalore     24
2     Trichy     34

In [31]:
#Merge
mergeVal = ps.merge(df1,df2,on='City')
mergeVal
#it will show common value for both data frame

        City Temp Degree
0    chennai   32     31
1  bangalore   22     24

In [32]:
#Outer Join
#It gets union value from data frames
mergeValOuter = ps.merge(df1,df2,on='City',how='outer') #Default value of how is inner
mergeValOuter

        City Temp Degree
0    chennai   32     31
1  bangalore   22     24
2        CBE   28    NaN
3     Trichy  NaN     34

In [33]:
#left join
#Full left dataframe values only
mergeValLeft = ps.merge(df1,df2,on='City',how='left') #Default value of how is inner
mergeValLeft

        City Temp Degree
0    chennai   32     31
1  bangalore   22     24
2        CBE   28    NaN

In [34]:
#Right join
#Full Right data frame values only
mergeValRight = ps.merge(df1,df2,on='City',how='left') #Default value of how is inner
mergeValRight

        City Temp Degree
0    chennai   32     31
1  bangalore   22     24
2        CBE   28    NaN

In [35]:
#indicator is used to know about joins
mergeValIndicate = ps.merge(df1,df2,on='City',how='outer',indicator=True) #Default value of indicator is False
mergeValIndicate

        City Temp Degree      _merge
0    chennai   32     31        both
1  bangalore   22     24        both
2        CBE   28    NaN   left_only
3     Trichy  NaN     34  right_only

In [36]:
#Same columns in data frames
val3 = {'City':['chennai','Ranchi','Trichy'],
       'Degree':['31','24','34']}
df3 = ps.DataFrame(val3)
df3

      City Degree
0  chennai     31
1   Ranchi     24
2   Trichy     34

In [38]:
SameColumns = ps.merge(df2,df3,on='City',how='outer') 
SameColumns
#it will automatically adding suffix for repeat column like  _x _y

        City Degree_x Degree_y
0    chennai       31       31
1  bangalore       24      NaN
2     Trichy       34       34
3     Ranchi      NaN       24

In [39]:
#Manually added Suffix 
SameColumns = ps.merge(df2,df3,on='City',how='outer',suffixes=['_left','_right']) 
SameColumns

        City Degree_left Degree_right
0    chennai          31           31
1  bangalore          24          NaN
2     Trichy          34           34
3     Ranchi         NaN           24